<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.1/css/all.min.css">
    <link rel="stylesheet" href="../style.css">
    <title>Segmentadas</title>
</head>
<body>
    <div class="head">

        <div class="logo">
            <a href="#"></a>
        </div>

        <nav class="navbar">
            <a href="../index.html">Inicio</a>
            <a href="./Unidad1.html">Unidad 1</a>
            <a href="./Unidad2.html">Unidad 2</a>
            <a href="./Unidad3.html">Unidad 3</a>
            <a href="./Unidad4.html">Unidad 4</a>
            <a href="./Unidad5.html">Prácticas</a>
            <a href="./Reportes.html">Reportes</a>
        </nav>

    </div>
    
    <header class="content header">

        <br><br><br><br><br><br><br><br><br><br><br><br>

        <h2 class="title">1.1.2 Segmentadas</h2>

        <p>
            Es una de las tecnolog&iacute;as utilizadas para realizar la segmentaci&oacute;n o 
            paralelismo. Divide el procesador, en etapas,procesa una instrucci&oacute;n diferente en 
            cada una y trabaja con varias a la vez.
            Pueden trabajar de forma paralela, en diferente instrucciones, utilizando una cola de 
            instrucciones para su comunicaci&oacute;n, denominado entubamiento.La dependencia de datos 
            y de control, que tiene como efecto la disminuci&oacute;n del rendimiento del pipelining.
        </p>

        <br><br><br><br><br>

        <p>La segmentaci&oacute;n de cauce (pipelining) es una forma efectiva de organizar el hardware 
            del CPU para realizar m&aacute;s de una operaci&oacute;n al mismo tiempo. Consiste en 
            descomponer el proceso de ejecuci&oacute;n de las instrucciones en fases o etapas que 
            permitan una ejecuci&oacute;n simult&aacute;nea. Explota el paralelismo entre las instrucciones 
            de un flujo secuencial.
        </p>

    </header>

    <section class="content sau">

<br><br><b><br><br><br><br><br><br><br><br>

        <p>
            La segmentaci&oacute;n es una t&eacute;cnica de implementaci&oacute;n por la cual se solapa 
            la ejecuci&oacute;n de m&uacute;ltiples instrucciones. La t&eacute;cnica de implementaci&oacute;n 
            clave utilizada para hacer CPU r&aacute;pidas.
            La segmentaci&oacute;n es como una l&iacute;nea de ensamblaje: cada etapa de la segmentaci&oacute;n
            completa una parte de la instrucci&oacute;n.
         </p>

            <br><br>

            <p>
                Como en una l&iacute;nea de ensamblaje, la acci&oacute;n a realizar en una
                instrucci&oacute;n se descompone en partes m&aacute;s pequeñas, cada una de las cuales 
                necesita una fracci&oacute;n del tiempo necesario para completar la instrucci&oacute;n 
                completa.
                Cada uno de estos pasos se define como etapa de la
                segmentaci&oacute;n o segmento.
                Las etapas est&aacute;n conectadas, cada una a la siguiente, para formar una especie de 
                cauce las instrucciones se entran por un extremo, son procesadas a trav&eacute;s de las 
                etapas y salen por
                el otro.
            </p>

    </section>

    <section class="content price">
        <article class="contain">

            <p>
                La productividad de la segmentaci&oacute;n est&aacute; determinada por la frecuencia con 
                que una instrucci&oacute;n salga del cauce.
                Como las etapas est&aacute;n conectadas entre s&iacute;, todas las etapas deben estar 
                listas para proceder al mismo tiempo. El tiempo requerido para desplazar una 
                instrucci&oacute;n, un paso, a lo largo
                del cauce es un ciclo m&aacute;quina. La duraci&oacute;n de un ciclo m&aacute;quina 
                est&aacute; determinada por el tiempo que necesita la etapa m&aacute;s lenta (porque todas 
                las etapas progresan a la vez).
                Con frecuencia, el ciclo m&aacute;quina es un ciclo de reloj (a veces dos, o 
                raramente m&aacute;s), aunque el reloj puede tener m&uacute;ltiples fases.
            </p>

        </article>    
    </section>

</body>
</html>