<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.1/css/all.min.css">
    <link rel="stylesheet" href="../style.css">
    <title>Tipos de Buses</title>
</head>
<body>
    <div class="head">

        <div class="logo">
            <a href="#"></a>
        </div>

        <nav class="navbar">
            <a href="../index.html">Inicio</a>
            <a href="./Unidad1.html">Unidad 1</a>
            <a href="./Unidad2.html">Unidad 2</a>
            <a href="./Unidad3.html">Unidad 3</a>
            <a href="./Unidad4.html">Unidad 4</a>
            <a href="./Unidad5.html">Prácticas</a>
            <a href="./Reportes.html">Reportes</a>
        </nav>

    </div>

    <header class="content header">
        <h2 class="title">1.2.4.1 Tipos de Buses</h2>

        <p>
            Bus es una palabra inglesa que significa “transporte”. En arquitectura de 
            computadores, un bus puede conectar l&oacute;gicamente varios perif&eacute;ricos
             sobre el mismo conjunto de cables. Aplicada a la inform&aacute;tica, se relaciona 
             con la idea de las transferencias internas de datos que se dan en un sistema 
             computacional en funcionamiento. En el bus todos los nodos reciben los datos 
             aunque no se dirijan a todos &eacute;stos, los nodos a los que no van dirigidos
              los datos simplemente los ignoran.

        </p>

    </header>

    <section class="content sau">

        <p>           
             Existen dos grandes tipos clasificados por el m&eacute;todo de 
             env&iacute;o de la informaci&oacute;n: paralelo o serial.
        </p>
        <p>
            Hay diferencias en el desempeño y hasta hace unos años se consideraba 
            que el uso apropiado depend&iacute;a de la longitud f&iacute;sica de la
             conexi&oacute;n: para cortas distancias el bus paralelo, para largas el serial.

        </p>
    </section>

    <section class="content about">   
        <h2 class="title">BUS PARALELO</h2>
        <p>           
            Es un bus en el cual los datos son enviados por bytes al mismo tiempo,
             con la ayuda de varias l&iacute;neas que tienen funciones fijas.
              La cantidad de datos enviada es bastante grande con una frecuencia 
              moderada y es igual al ancho de los datos por la frecuencia de funci&oacute;n
               computadores ha sido usado de manera intensiva, desde el bus del procesador,
                los buses de discos duros, tarjetas de expansi&oacute;n y de v&iacute;deo, 
                hasta las impresoras.
        </p>

        <p>
            El Front Side Bus de los procesadores Intel es un bus de este tipo y como
             cualquier bus presenta unas funciones en l&iacute;neas dedicadas:

        </p>
        <p> 
            Las L&iacute;neas de Direcci&oacute;n con el que se desea establecer comunicaci&oacute;n.

        </p>
    </section>

    <section class="content price">
        
        <article class="contain">
            <br><br><br><br><br><br><br><br><br><br><br>
            
            <br><br><br><br><br><br><br><br><br><br><br>
            
            <br><br><br><br><br><br><br><br><br><br><br>

            <p>           
                Las L&iacute;neas de Control son las encargadas de enviar
                 señales de arbitraje entre los dispositivos. Entre las m&aacute;s 
                 importantes est&aacute;n las l&iacute;neas de interrupci&oacute;n,
                  DMA y los indicadores de estado.
            </p>

            <p>
                Las L&iacute;neas de Datos trasmiten los bits, de manera que por lo 
                general un bus tiene un ancho que es potencia de 2.

            </p>
            
            <p>

                Un bus paralelo tiene conexiones f&iacute;sicas complejas, pero la l&oacute;gica 
                es sencilla, que lo hace &uacute;til en sistemas con poco poder de c&oacute;mputo.
                 En los primeros microcomputadores, el bus era simplemente la extensi&oacute;n del 
                 bus del procesador y los dem&aacute;s integrados “escuchan” la l&iacute;nea de direcciones,
                  en espera de recibir instrucciones. En el PC IBM original, el diseño del bus fue 
                  determinante a la hora de elegir un procesador con I/O de 8 bits (Intel 8088),
                   sobre uno de 16 (el 8086), porque era posible usar hardware diseñado para otros
                    procesadores, abaratando el producto.
            </p>

            
            <p center><img src="../img/paralelo.jpg" height="450" width="200"></p>
        </article>    
    </section>
    <section class="content price"></section>
    
    <section class="content price">
    </section>
    <section class="content contact">
        
        <br><br><br><br><br><br><br><br><br><br><br>
        <br><br><br><br><br><br><br><br><br><br><br>
        <h2 class="title">BUS SERIE</h2>

        <p>
            En este los datos son enviados, bit a bit y se reconstruyen por 
            medio de registros o rutinas de software. Est&aacute; formado por
         pocos conductores y su ancho de banda depende de la frecuencia. Es usado 
         desde hace menos de 10 años en buses para discos duros, tarjetas de expansi&oacute;n y 
         para el bus del procesador.
           
        </p>
        
        <p center><img src="../img/serie.jpg" height="450" width="200"></p>

    </section>
    
    <section class="content price"></section>
    
    <section class="content price">
    </section>
</body>
</html>