<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.1/css/all.min.css">
    <link rel="stylesheet" href="../style.css">
    <title>Registros</title>
</head>
<body>

    <div class="head">

        <div class="logo">
            <a href="#"></a>
        </div>

        <nav class="navbar">
            <a href="../index.html">Inicio</a>
            <a href="./Unidad1.html">Unidad 1</a>
            <a href="./Unidad2.html">Unidad 2</a>
            <a href="./Unidad3.html">Unidad 3</a>
            <a href="./Unidad4.html">Unidad 4</a>
            <a href="./Unidad5.html">Prácticas</a>
            <a href="./Reportes.html">Reportes</a>
        </nav>

    </div>

    <header class="content header">
        <h2 class="title">1.2.1.3 Registros</h2>

        <p>
            Este tema se conecta directamente con algunos puntos anteriores ya que:
            Un programa es un conjunto de instrucciones almacenadas de acuerdo al orden en 
            que deben ejecutarse.
            Por lo tanto, toda computadora debe ser capaz de procesar las instrucciones de su 
            programa en un ciclo de instrucci&oacute;n, consistente en un n&uacute;mero de 
            etapas que var&iacute;a con cada CPU, pero que tradicionalmente han sido tres 
            (trabajando en un cpu ideal).
           
        </p>

    </header>
    <section class="content sau">
        <h2 class="title">B&uacute;squeda del c&oacute;digo de Instrucci&oacute;n</h2>

        <p>Esta consiste en leer de la memoria cual ser&aacute; la siguiente instrucci&oacute;n a e
            jecutar, la cual esta almacenada en forma de un c&oacute;digo num&eacute;rico que indica 
            cual de todas las operaciones que puede realizar el CPU ser&aacute; la siguiente y con 
            que operandos se ejecutar&aacute;.
           </p>
    </section>

    <section class="content price">
        <article class="contain">
            <h2 class="title"> Decodificaci&oacute;n.</h2>

            <p>Consiste en tomar el c&oacute;digo num&eacute;rico e identificar a cu&aacute;l de 
                las operaciones que puede realizar el CPU corresponde dicho c&oacute;digo.
                Esta etapa usualmente se realiza con un decodificador binario.</p>

        </article>    
    </section>
    <section class="content price">
        <br><br><br><br><br><br><br><br><br><br><br>
        <article class="contain">
            <h2 class="title"> Ejecuci&oacute;n</h2>
            <p>En esta etapa se lleva a cabo la operaci&oacute;n sobre los datos que se vayan a 
                procesar. En general, la unidad de control (UC) genera las señales de control 
                necesarias para llevar los datos a las entradas de la Unidad Aritm&eacute;tica 
                L&oacute;gica, la cual efectuar&aacute; las operaciones aritm&eacute;ticas y l&oacute;gicas.
                Posteriormente, la unidad de control generara las señales de control necesarias 
                para transferir la salida de la Unidad Aritm&eacute;tica L&oacute;gica al registro 
                donde ser&aacute;n almacenados los resultados para su uso posterior.
                </p>
                <p center><img src="../img/registros.jpg" height="370" width="600"></p>
        </article>
    </section>
    <section class="content price"></section>
</body>
</html>