<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.1/css/all.min.css">
    <link rel="stylesheet" href="../style.css">
    <title>Jerarquia de Buses</title>
</head>
<body>

    <div class="head">

        <div class="logo">
            <a href="#"></a>
        </div>

        <nav class="navbar">
            <a href="../index.html">Inicio</a>
            <a href="./Unidad1.html">Unidad 1</a>
            <a href="./Unidad2.html">Unidad 2</a>
            <a href="./Unidad3.html">Unidad 3</a>
            <a href="./Unidad4.html">Unidad 4</a>
            <a href="./Unidad5.html">Prácticas</a>
            <a href="./Reportes.html">Reportes</a>
        </nav>

    </div>

    <header class="content header">
        <h2 class="title">1.2.4.3 Jerarqu&iacute;a de Buses</h2>

        <p>
            El computador tiene diferentes tipos de buses. Los computadores modernos tienen 
            por lo menos 4 buses diferentes. Se les considera una jerarqu&iacute;a porque cada 
            bus se conecta al nivel superior a &eacute;l dentro del computador integrando as&iacute;
         todas las partes del computador. Cada uno es generalmente m&aacute;s lento que el que se 
         encuentra sobre &eacute;l (siendo el bus del procesador el m&aacute;s r&aacute;pido 
         trat&aacute;ndose de que este es el dispositivo m&aacute;s r&aacute;pido del computador)

        </p>

    </header>

    <section class="content sau">
        <h2 class="title">Bus Interno</h2>

        <p>           
             Es el nivel m&aacute;s alto en la jerarqu&iacute;a. Es el bus 
             que comunica las partes internas del procesador.
        </p>
        
        </section>
    
        
    <section class="content about">
        <h2 class="title"> Bus del Procesador</h2>

        <p>
            Es usado para enviar informaci&oacute;n desde y hacia el procesador.</p>

    </section>

    <section class="content price">
        <article class="contain">
            <h2 class="title">Bus del Cache</h2>

            <p>L             
                Es un bus dedicado que se tiene en algunas arquitecturas para acceder 
                el cach&eacute;. En otras arquitecturas el cach&eacute; se conecta directamente
             al bus de memoria.
            </p>

        </article>    
    </section>

    <section class="content contact">
        <h2 class="title">Bus de Memoria</h2>

        <p>            
            Este bus conecta la memoria al procesador. En algunos sistemas los buses
             de memoria y del procesador son b&aacute;sicamente los mismos.
        </p>

        
    </section>

    <section class="content sau">
        <h2 class="title">Bus Local de E/S</h2>

        <p>           
            Este es un bus de alta velocidad de entrada/salida y es usado para conectar 
            perif&eacute;ricos cuyo desempeño es cr&iacute;tico (tarjetas de video, discos,
            redes de alta velocidad) con la memoria y el procesador. Los m&aacute;s conocidos 
            son los buses VESA y PCI.
        </p>

    </section>

    <section class="content about">
        <h2 class="title"> El Bus est&aacute;ndar de E/S</h2>

        <p>           
            Este es un bus usado para conectar dispositivos de E/S de baja velocidad
             (rat&oacute;n, m&oacute;dems, tarjetas de sonido).

        </p>
    </section>

    <section class="content price">
        <article class="contain">

            <p>Para dispositivos de video existe tambi&eacute;n el bus AGP (Accelerated Graphics Port). 
                Este no es propiamente un bus en el sentido que no puede ser compartido por varios
                 dispositivos, sino que s&oacute;lo permite conectar a &eacute;l dos dispositivos 
                 (por esto su nombre de puerto).
            </p>

            <p center><img src="../img/jerar.jpg" height="350" width="550"></p>

        </article>    
    </section>
    
    <section class="content price"></section>


</body>
</html>