<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.1/css/all.min.css">
    <link rel="stylesheet" href="../style.css">
    <title> Buses</title>
</head>
<body>
    <div class="head">
    <div class="logo">
        <a href="#"></a>
    </div>

    <nav class="navbar">
        <a href="../index.html">Inicio</a>
            <a href="./Unidad1.html">Unidad 1</a>
            <a href="./Unidad2.html">Unidad 2</a>
            <a href="./Unidad3.html">Unidad 3</a>
            <a href="./Unidad4.html">Unidad 4</a>
            <a href="./Unidad5.html">Prácticas</a>
            <a href="./Reportes.html">Reportes</a>
    </nav>

</div>

<header class="content header">
    <h2 class="title">1.2.4   Buses </h2>

    <p>
        Se denomina bus, en inform&aacute;tica, al conjunto de conexiones f&iacute;sicas
         (cables, placa de circuito impreso, etc.) que pueden compartirse con m&uacute;ltiples 
         componentes de hardware para que se comuniquen entre s&iacute;.

    </p>
</header>


<section class="content sau">
    <h2 class="title">Introducci&oacute;n al concepto de bus</h2>

    <p> Cu&aacute;les son las caracter&iacute;sticas de un bus inform&aacute;tico
        Cu&aacute;les son los subconjuntos de un bus
        Cu&aacute;les son los principales tipos de bus
        Qu&eacute; es el 'chipset'
        
    
</p>

<p>    El prop&oacute;sito de los buses es reducir el n&uacute;mero de rutas necesarias para
     la comunicaci&oacute;n entre los distintos componentes, al realizar las comunicaciones 
     a trav&eacute;s de un solo canal de datos. Esta es la raz&oacute;n por la que, a veces,
      se utiliza la met&aacute;fora autopista de datos.</p>
</section>


<section class="content about">
    <p>Si solo dos componentes de hardware se comunican a trav&eacute;s de la l&iacute;nea, 
        se habla de puerto hardware (puerto serial o puerto paralelo).
    </p>

</section>

<section class="content price">
    <article class="contain">

        <p>
        Un bus se caracteriza por la cantidad de informaci&oacute;n que
         se transmite en forma simult&aacute;nea. Este volumen se expresa en bits y
          corresponde al n&uacute;mero de l&iacute;neas f&iacute;sicas mediante las 
          cuales se env&iacute;a la informaci&oacute;n en forma simult&aacute;nea. Un
           cable plano de 32 hilos permite la transmisi&oacute;n de 32 bits en paralelo.
         El t&eacute;rmino “ancho” se utiliza para designar el n&uacute;mero de bits que un 
         bus puede transmitir simult&aacute;neamente.
            </p>

            <p>
                Por otra parte, la velocidad del bus se define a trav&eacute;s de 
                su frecuencia (que se expresa en hercios o hertz), es decir el n&uacute;mero 
                de paquetes de datos que pueden ser enviados o recibidos por segundo. Cada vez 
                que se env&iacute;an o reciben estos datos podemos hablar de ciclo. De esta manera,
                 es posible hallar la velocidad de transferencia m&aacute;xima del bus (la cantidad 
                 de datos que puede transportar por unidad de tiempo) al multiplicar su ancho por la 
                 frecuencia. Por lo tanto, un bus con un ancho de 16 bits y una frecuencia de 133 MHz
                  tiene una velocidad de transferencia igual a:
            
            </p>

            
            <p center><img src="../img/bus2.png" height="60" width="500"></p>
            
    </article>    
</section>

<section class="content price"></section>

</body>
</html>