<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.1/css/all.min.css">
    <link rel="stylesheet" href="../style.css">
    <title>Analisis de los Componentes</title>
</head>
<body>

    <div class="head">

        <div class="logo">
            <a href="#"></a>
        </div>

        <nav class="navbar">
            <a href="../index.html">Inicio</a>
            <a href="./Unidad1.html">Unidad 1</a>
            <a href="./Unidad2.html">Unidad 2</a>
            <a href="./Unidad3.html">Unidad 3</a>
            <a href="./Unidad4.html">Unidad 4</a>
            <a href="./Unidad5.html">Prácticas</a>
            <a href="./Reportes.html">Reportes</a>
        </nav>

    </div>

    <header class="content header">
        <h2 class="title">1.2 An&aacute;lisis de los Componentes</h2>

        <p>
        An&aacute;lisis de componentes b&aacute;sicos de una computadora de escritorio.Una
        computadora est&aacute; formada fundamentalmente por dos aspectos b&aacute;sicos:
        Hardware y software.
        Tenemos componentes esenciales y espec&iacute;ficos para tareas puntuales.
        </p>

    </header>

    <section class="content sau">
        <br><br><br><br><br><br><br><br><br>
        <br><br><br><br><br><br><br><br><br><br><br>
        <h2 class="title">Componentes Internos.</h2>

        <p>Cuando hablamos de una computadora nos referimos al conjunto
            de componentes internos que se encuentra colocados dentro del gabinete.
            Como sabes, los componentes internos son los que componen el hardware de
            la computadora.
            Los principales componentes internos de la computadora son:</p>

            <div class="box-container">
                <div class="box">
                    <i class="fab fa-angular"></i>
                    <p>Tarjeta madre (Motherboard) , placa base</p>

                </div>

                <div class="box">
                    <i class="fab fa-angular"></i>

                    <p>CPU o procesador</p>

                </div>
                <div class="box">
                    <i class="fab fa-angular"></i>

                    <p>Memoria RAM</p>

                </div><div class="box">
                    <i class="fab fa-angular"></i>

                    <p>Disco duro (HD)</p>

                </div><div class="box">
                    <i class="fab fa-angular"></i>

                    <p>Fuente de alimentaci&oacute;n</p>

                </div>
            </div>

    </section>

    <section class="content sau">
        <br><br><br><br><br><br><br><br><br><br><br><br>
        <br><br><br><br><br><br><br><br><br><br><br><br>
        <br><br><br><br><br><br><br><br><br><br><br><br>
            <p>
            Adem&aacute;s por lo general para evitar que en el interior de gabinete se acumule
            calor que generan estos componentes, se añaden otros elementos que tambi&eacute;n
            son considerados componentes internos.
            Estos pueden ser:
            </p>

            <div class="box-container">
                <div class="box">
                    <i class="fab fa-angular"></i>

                    <p>Disipadores</p>

                </div>
                <div class="box">
                    <i class="fab fa-angular"></i>

                    <p>Ventiladores</p>

                </div>
                <div class="box">
                    <i class="fab fa-angular"></i>

                    <p>Refrigeraci&oacute;n l&iacute;quida</p>

                </div>
            </div>

    </section>
    <section class="content sau">

    </section>

    <section class="content about">
        <br><br><br><br><br><br><br><br><br><br><br><br>
        <br><br><br><br><br><br><br><br><br><br><br><br>
        <h2 class="title">Tarjeta Madre (MotherBoard)</h2>

        <p>La tarjeta madre (MB) , tambi&eacute;n llamada “placa base” es de los componentes
            esenciales de las computadoras. En ella se conectan los diferentes
            componentes internos, incluyendo el procesador CPU, la memoria RAM, la
            tarjeta gr&aacute;fica, los discos duros, es decir todos los elementos internos.
            En su forma, la tarjeta madre est&aacute;n construidas en una placa en la que se
            encuentra un circuito integrado que interconecta un conjunto de chips, y
            componentes electr&oacute;nicos, conectores etc.
            Adem&aacute;s, dentro de una tarjeta madre pueden estar incorporados de f&aacute;brica los
            siguientes componentes:
        </p>


        <div class="box-container">
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Tarjeta de sonido</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Tarjeta de red</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Ranuras de expansi&oacute;n</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Tarjeta gr&aacute;fica</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Puertos</p>

            </div>
        </div>

    </section>
    <section class="content about">
        <br><br><br><br><br><br><br><br><br><br><br><br>
        <br><br><br><br><br><br><br><br><br><br><br><br>
        <br><br><br><br><br><br><br><br><br><br><br><br>
        <br><br><br><br><br><br><br><br><br><br><br><br>
        <br><br><br><br><br><br><br><br><br><br><br><br>
        <p>
            No todas las placas base son iguales. Por lo que se tiene que saber los
            componetes y especificaciones que soporte la misma y sean compatibles, el
            procesador y los componentes.
            La tarjeta madre es la que va a determinar el tipo de procesador y cantidad de
            m&oacute;dulos de memoria RAM que pueden instalarse, la cantidad y los tipos de 
            discos duros que se conecten y la tarjeta de video que podr&aacute;s instalar en 
            ella, entre otras cosas.
        </p>

        <p center><img src="../img/tarjeta.png" height="300" width="400"></p>
    </section>
    <section class="content about">
    </section>
    <section class="content about">
    </section>

    <section class="content contact">
        <h2 class="title">El procesador Unidad Central de Procesamiento CPU.</h2>

        <p>El CPU es algo as&iacute; como el cerebro de tu computadora. En realidad es el
            elemento encargado de analizar y procesar toda la informaci&oacute;n que ingresa y
            sale de la computadora.
            El procesador decodifica y ejecuta las instrucciones de los programas que se
            encuentran cargados en la memoria principal de la computadora.
            Adem&aacute;s funciona como coordinador y controlador de casi todos los otros
            componentes, tanto de los internos como de los externos.
        </p>
        <p>
            Debido a su misi&oacute;n dentro de la computadora, el procesador es el que define la
            velocidad de proceso que logre obtener la computadora. A mayor cantidad de
            GHz, mayor ser&aacute; la velocidad alcanzada.
            En cuanto a marcas, las m&aacute;s conocidas en el mercado actual son Intel y
            AMD.Pero adem&aacute;s, los procesadores pueden ser seleccionados por cantidad
            de los bits a procesar por ciclo:
        </p>

    </section>
    
    <section class="content sau">

            <div class="box-container">
                <div class="box">
                    <i class="fab fa-angular"></i>
                    <p>32 bits</p>

                </div>
                <div class="box">
                    <i class="fab fa-angular"></i>
                    <p>64 bits</p>

                </div>
            </div>
        </section>
        <section class="content about">
            <p>
                La mayor&iacute;a de los procesadores suelen incorporar de f&aacute;brica un ventilador
                para mantenerlo en condiciones &oacute;ptimas de temperatura el componente.
            </p>
    
            <p center><img src="../img/procesador.png" height="300" width="400"></p>
        </section>
        <section class="content about">
        </section>

        <section class="content price">
            <article class="contain">
                <h2 class="title">Memoria RAM.</h2>
    
                <p>La Random Access Memory o m&aacute;s conocida como memoria RAM se conecta
                    a la tarjeta madre y en ella se guardan y se cargan las instrucciones que se
                    ejecutan en el procesador.
                    Esas instrucciones son enviadas desde los componentes y dispositivos
                    conectados a la tarjeta madre y a los puertos de la computadora.
                    Las caracter&iacute;sticas principales que definen el funcionamiento de la memoria
                    RAM son (soportadas por la tarjeta madre):</p>
    
            </article>    
        </section>
 
        <section class="content sau">
    
                <div class="box-container">
                    <div class="box">
                        <i class="fab fa-angular"></i>
                        <p>Cantidad de memoria en GB</p>
                    </div>
                    <div class="box">
                        <i class="fab fa-angular"></i>
                        <p>Tipo de memoria RAM</p>
                    </div>
                    <div class="box">
                        <i class="fab fa-angular"></i>
                        <p>Velocidad de la memoria</p>
                    </div>
                    <div class="box">
                        <i class="fab fa-angular"></i>
                        <p>Tipo de ranura</p>
                    </div>

                </div>
        </section>
        <section class="content price">
            <br><br><br><br><br><br><br><br><br><br><br><br><br>
            <article class="contain">
    
                <p> Es importante que tengas claro estos datos para elegir el tipo de
                    memoria RAM correcta para tu equipo. En definitiva la tarjeta madre ser&aacute; el
                    elemento que defina el tipo y la cantidad de RAM que puedes instalar.</p>
                    <p center><img src="../img/memoriaRam.png" height="300" width="400"></p>
    
            </article>    
        </section>
        <section class="content price">
            <article class="contain">
            </article>
        </section>

        <section class="content price">
            <article class="contain">
                <h2 class="title">Disco duro</h2>
    
                <p>El disco duro de tu computadora es el componente encargado de almacenar de
                    forma permanente sistemas operativos as&iacute; como los datos que ingresan en la
                    computadora.
                    Todo la informaci&oacute;n que contiene la computadora, incluyendo documentos
                    (archivos, aplicaciones, fotograf&iacute;as m&uacute;sica, descargas de internet, etc.) Pero
                    adem&aacute;s en &eacute;l tambi&eacute;n se almacena el sistema operativo y todos los
                    programas instalados en la computadora.
                    Para poder ser el soporte de almacenamiento principal de la computadora, el
                    disco duro pueden contener grandes cantidades de informaci&oacute;n.
                    Todos los datos de la computadora se almacenan en el disco duro, de ah&iacute; su
                    importancia.
                    Por esto, un disco duro debes tener presente los siguientes datos:</p>

            </article>    
        </section>

        <section class="content sau">
    
                <div class="box-container">
                    
                    <div class="box">
                        <i class="fab fa-angular"></i>
                        <p>Capacidad</p>
    
                    </div>
                    <div class="box">
                        <i class="fab fa-angular"></i>
                        <p>Velocidad de conexi&oacute;n</p>
    
                    </div>
                    <div class="box">
                        <i class="fab fa-angular"></i>
                        <p>Velocidad de RPM</p>
    
                    </div>
                </div>
                <p>En cuanto al tipo de conexi&oacute;n que requieren, los discos duros pueden ser:</p>
        </section>
        <section class="content sau">
    
            <div class="box-container">
                
                <div class="box">
                    <i class="fab fa-angular"></i>
                    <p>IDE</p>

                </div>
                <div class="box">
                    <i class="fab fa-angular"></i>
                    <p>SATA</p>

                </div>
                
            </div>

            <p>Adem&aacute;s, hoy existen distintos tipos de discos duros, que se diferencias
                dependiendo de la tecnolog&iacute;a utilizada para su construcci&oacute;n. Hoy puedes
                encontrar los siguientes tipos de discos duros:</p>
    </section>
    
    <section class="content sau">
    <br><br><br><br><br><br><br><br><br>
        <div class="box-container">
            
            <div class="box">
                <i class="fab fa-angular"></i>
                <p>HD (disco mec&aacute;nico tradicional)</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>
                <p>SD (disco de estado s&oacute;lido)</p>

            </div>
            
        </div>

        <p>
            Es importante tambi&eacute;n destacar que en los &uacute;ltimos tiempos los discos duros
            tradicionales est&aacute;n siendo reemplazados por modernas unidades de
            almacenamiento de tipo memoria Flash.
            Estas memorias flash no emiten calor ni ruido, tampoco se desgastan con el
            paso del tiempo y son realmente r&aacute;pidas.
           
        </p>
        <p center><img src="../img/discoDuro.png" height="300" width="400"></p>
</section>
<section class="content sau">
</section>
<section class="content price">
    <br><br><br><br><br><br>
    <article class="contain">
        <h2 class="title">Fuente de alimentaci&oacute;n.</h2>

        <p>La fuente de alimentaci&oacute;n es el componente que proporciona corriente
            el&eacute;ctrica a todos los elementos de la computadora. Esta se encuentra dentro
            del gabinete.
            Para ello, la fuente de alimentaci&oacute;n transforma la corriente alterna de la red de
            tu casa en corriente continua. Luego de ello la distribuye a todos los
            componentes que est&eacute;n conectados a la computadora.
            Es importante tener en cuenta que las fuentes de alimentaci&oacute;n suelen manejar
            diferentes voltajes 12 Volts, 5 Volts y 3.3 Volts. Un dato importante en una
            fuente de alimentaci&oacute;n es la potencia que entrega. En este caso a m&aacute;s
            potencia, mayor capacidad para conectar componentes.
            En general una fuente de alimentaci&oacute;n puede tener una potencia de 400W a
            500W, aunque para computadoras que poseen hardware adicional, como
            tarjeta gr&aacute;fica para jugar videojuegos, se recomienda una fuente de 700W
            como m&iacute;nimo. Lo mejor es una fuente de m&aacute;s de 1000W.</p>

            <p center><img src="../img/fuente.png" height="300" width="400"></p>
    </article>    
</section>
<section class="content price"></section>
<section class="content contact">
    <h2 class="title">Tarjetas de expansi&oacute;n.</h2>

    <p>Estas tarjetas es si no est&aacute;n incluidas en la tarjeta madre o bien requieren de
        una mejor&iacute;a en su desempeño.</p>
        <p center><img src="../img/texpansion.jpg" height="300" width="400"></p>
</section>
<section class="content contact"></section>
<section class="content price">
    <article class="contain">
        <h2 class="title">Tarjeta gr&aacute;fica</h2>

        <p>La tarjeta gr&aacute;fica, tambi&eacute;n llamada placa o tarjeta de video es un dispositivo
            que se conecta a la ranura de expansi&oacute;n de la placa base.
            La misma incluye un procesador gr&aacute;fico o GPU, el cual se encarga de procesar
            los gr&aacute;ficos de la computadora.
            Lo cierto es que por lo general la tarjeta gr&aacute;fica de alta capacidad no viene
            incluida en la computadora, ya que la mayor&iacute;a de las placas base incluyen de
            f&aacute;brica un circuito capaz de encargarse de realizar el procesamiento de los
            gr&aacute;ficos.
            Es un componente que muchas veces puedes llegar a requerir, sobre todo si
            manejas gr&aacute;ficos de gran magnitud, por ejemplo para jugar videojuegos o
            aplicaciones de diseño gr&aacute;fico, etc.
            El procesador gr&aacute;fico de una tarjeta gr&aacute;fica es mucho m&aacute;s potente que los que
            suelen incluir las placas base. Adem&aacute;s, act&uacute;a como memoria RAM
            independiente, mejorando los procesos visuales.
        </p>
        <p>
            Por supuesto debes tener en cuenta que la tarjeta de video sea compatible con
            la placa base, es decir que la interface para la comunicaci&oacute;n entre ambos
            elementos sea AGP, PCI o PCI-express.        
        </p>

        <p center><img src="../img/tgrafica.jpg" height="300" width="400"></p>

    </article>    
</section>
<section class="content price"></section>
<section class="content sau">
    <br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
    <h2 class="title">Tarjeta de red</h2>

    <p>Por lo general, las computadoras suelen incluir la tarjeta de red incorporada a
        la placa base de la misma. Por eso no es de extraña que ignores su existencia.
        En el caso en que tu computadora no posea tarjeta de red o se haya descompuesto, 
        siempre puedes añadir una nueva a trav&eacute;s de la ranura PCI- express. La tarjeta de 
        red b&aacute;sicamente es la que te va a permitir conectarte a tu router para poder usar 
        internet en la computadora.
        Se las conoce como tarjetas de expansi&oacute;n y existen dos grandes tipos de ellas:
    </p>

        <div class="box-container">
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Ethernet: Para conexi&oacute;n a internet por cable</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Wi-Fi: Para conexi&oacute;n a internet inal&aacute;mbrica</p>

            </div>
        </div>

        <p center><img src="../img/tred.jpg" height="300" width="400"></p>
</section>
<section class="content sau"></section>

<section class="content sau">
   
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
<br><br><br><br><br><br><br><br>
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
    <h2 class="title">Disipadores y ventiladores</h2>

    <p>Un disipador recoge el calor que genera un componente y lo disipa para que
        reduzca la temperatura de ese elemento electr&oacute;nico.</p>
    
       <p>Se suma a ello los ventiladores internos de gabinete, que cumplen la funci&oacute;n
        de mantener un flujo de aire constante en el interior del gabinete. Existen
        sistemas para mantener la temperatura de la computadora llamados
        refrigeraci&oacute;n l&iacute;quida.</p> 


        <p>Componentes Externos</p>
        <div class="box-container">
            <div class="box">
                <i class="fab fa-angular"></i>
                <p>Gabinete</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Monitor</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Mouse</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Teclado</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Bocinas</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Micr&oacute;fono</p>

            </div>
        </div>

        <p>Seg&uacute;n aplicaci&oacute;n de usuario.</p>
        <div class="box-container">
            <div class="box">
                <i class="fab fa-angular"></i>
                <p>C&aacute;mara web</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Esc&aacute;neres</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Controles de juegos de video</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Sensor de huellas digitales</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Lector de c&oacute;digo de barras</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Micr&oacute;fono</p>

            </div>
            <div class="box">
                <i class="fab fa-angular"></i>

                <p>Equipos especializados (m&eacute;dicos y musicales, entre otros) etc.</p>

            </div>
        </div>
        <p center><img src="../img/ventilador.jpg" height="300" width="400"></p>
</section>
<section class="content sau"></section>
<section class="content sau"></section>


<section class="content sau"></section>
<section class="content price">
    <article class="contain">
        <br><br><br><br><br><br>
        <h2 class="title">Gabinete</h2>

        <p>B&aacute;sicamente es el armaz&oacute;n para tener los elementos de la computadora dentro
            del gabinete vas a encontrar el CPU, como as&iacute; tambi&eacute;n las memorias RAM, la tarjeta madre, el disco duro, buses , tarjetas de expansi&oacute;n, fuente de alimentaci&oacute;n entre otros.
            Un dato importante que debes tener en cuenta es que pr&aacute;cticamente todos los
            componentes de una computadora est&aacute;n conectados por cables a la unidad del
            sistema.
            Los cables se encuentran conectados a las entradas o puertos espec&iacute;ficos, que
            se encuentran normalmente en la parte posterior de la unidad de sistema.</p>

            <p center><img src="../img/gabinete.jpg" height="300" width="400"></p>
    </article>    
</section>
<section class="content price"></section>
<section class="content sau">
    <br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
    <h2 class="title">Mouse (rat&oacute;n)</h2>

    <p> Es el dispositivo utilizado para apuntar y seleccionar objetos, carpetas en la
        computadora.
        Puedes encontrar diversos tipos de mouses. Los que se conectan por cable y
        los inal&aacute;mbricos, pero adem&aacute;s los que poseen dos botones y una rueda, o que
        est&aacute;n llenos de botones y te permiten obtener una mejor experiencia al jugar.
        Los mouse se clasifican de la siguiente manera:</p>

        <div class="box-container">
            <div class="box">
                <i class="fab fa-angular"></i>
                <p>Mec&aacute;nicos</p>
            </div>
            <div class="box">
                <i class="fab fa-angular"></i>
                <p>&oacute;pticos</p>
            </div>
            <div class="box">
                <i class="fab fa-angular"></i>
                <p>Inal&aacute;mbricos</p>
            </div>
        </div>
        <p>
            La selecci&oacute;n del mouse depende en mayor medida de la comodidad del
            usuario.
            En definitiva apuntar y pulsar con el mouse es la forma principal que te
            permite interactuar con la computadora.
        </p>
        <p center><img src="../img/mouse.jpg" height="300" width="400"></p>

    </section>
    <section class="content sau"></section>

    <section class="content price">
        <br><br><br><br><br><br><br><br><br>
        <br><br><br><br><br>
        <article class="contain">
            <h2 class="title">Teclado</h2>

            <p> El teclado es principalmente utilizado para escribir textos en la computadora.
                Tal como el teclado de una m&aacute;quina de escribir, letras y n&uacute;meros, pero
                tambi&eacute;n posee teclas especiales que incluye las de funci&oacute;n, 
                las num&eacute;ricas y las de navegaci&oacute;n.
                El mouse como el teclado son considerados los principales perif&eacute;ricos de
                entrada.</p>

                <p center><img src="../img/teclado.jpg" height="300" width="400"></p>
        </article>    
    </section>
    <section class="content price">

    </section>

    <section class="content sau">
        <h2 class="title">Monitor</h2>

        <p>El monitor presenta informaci&oacute;n en forma visual, utilizando texto y gr&aacute;ficos.
            La parte del monitor que presenta la informaci&oacute;n es llamada pantalla, la de
            una computadora despliega la informaci&oacute;n e im&aacute;genes de las aplicaciones o
            archivos requeridos.
            Existen tipos b&aacute;sicos de monitores:</p>

            <div class="box-container">
                <div class="box">
                    <i class="fab fa-angular"></i>

                    <p>Monitores CRT (Cathode Ray Tube o tubo de rayos c&aacute;todicos)</p>

                </div>
                <div class="box">
                    <i class="fab fa-angular"></i>


                    <p>Monitores LCD (Liquid Crystal Display)</p>

                </div>
                <div class="box">
                    <i class="fab fa-angular"></i>

                    <p>Monitores LED</p>

                </div>

            </div>
        </section>

        <section class="content contact">
            
    <br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>

            <p>Ten en cuenta que si bien todos producen im&aacute;genes n&iacute;tidas, los monitores
                LCD y LED tienen la ventaja de ser mucho m&aacute;s delgados y livianos.</p>
            <p>
                Ruteadores o m&oacute;dems son considerados como perif&eacute;ricos h&iacute;bridos, ya que
                permiten la entrada y salida de datos.
                Adem&aacute;s, para poder disponer de internet Wi-Fi con buena señal en toda la
                casa, lo mejor es recurrir a repetidores Wi-Fi.
            
            </p>
            <p>
                Controlador MIDI MIDI son las siglas de Musical Instrument Digital Interface.
                Los controladores MIDI se conectan a la computadora y te
                permiten reproducir o grabar sonidos.
            </p>

            <p center><img src="../img/monitor.jpg" height="300" width="400"></p>

  
    
        </section>
        <section class="content contact">
        </section>
</body>
</html>