<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.1/css/all.min.css">
    <link rel="stylesheet" href="../style.css">
    <title>Conjunto de instrucciones: Caracter&iacute;sticas y Funciones</title>
</head>
<body>
    <div class="head">

        <div class="logo">
            <a href="#"></a>
        </div>

        <nav class="navbar">
            <a href="../index.html">Inicio</a>
            <a href="./Unidad1.html">Unidad 1</a>
            <a href="./Unidad2.html">Unidad 2</a>
            <a href="./Unidad3.html">Unidad 3</a>
            <a href="./Unidad4.html">Unidad 4</a>
            <a href="./Unidad5.html">Prácticas</a>
            <a href="./Reportes.html">Reportes</a>
        </nav>

    </div>

    <header class="content header">
        <h2 class="title">2.3.3 Conjunto de instrucciones: Caracter&iacute;sticas y Funciones</h2>

        <p>
            Ante el diseño de un nuevo ordenador de prop&oacute;sito general hay que plantearse
             la siguiente cuesti&oacute;n: ¿Qu&eacute; tipos de instrucciones deben ser incluidos 
             en su conjuntos de instrucciones? Antes de responder a esta pregunta, analizaremos las
              caracter&iacute;sticas que deben tener los juegos de instrucciones de las m&aacute;quinas.
               Los conjuntos de instrucciones de las m&aacute;quinas deben tender a poseer una serie de 
               propiedades, bastante ideales e imprecisas, que pueden resumirse en las siguientes: 
               El conjunto de instrucciones de un computador debe ser completo en el sentido de que 
               se pueda construir un programa para evaluar una funci&oacute;n computable usando una 
               cantidad de memoria razonable y empleando un tiempo moderado, es decir, el n&uacute;mero 
               de instrucciones de ese programa no debe ser demasiado elevado. Los juegos de instrucciones
                tambi&eacute;n tienen que ser eficientes, esto significa que las funciones m&aacute;s 
                necesarias deben poder realizarse usando pocas instrucciones.

        </p>

    </header>

    <section class="content sau">

        <p> El conjunto de instrucciones de una m&aacute;quina debe ser regular, es decir
            debe ser sim&eacute;trico (por ejemplo, si existe una instrucci&oacute;n de 
            desplazamiento a la izquierda, debe haber otra de desplazamiento a la derecha, 
            etc.) y ortogonal, es decir, deben poder combinarse, en la medida de lo posible, 
            todos las operaciones con todos los tipos de datos y modos de direccionamiento. 
            En muchas ocasiones, tambi&eacute;n se le debe exigir a un computador que su juego
             de instrucciones sea compatible con modelos anteriores.
        </p>
    </section>


    <section class="content about">
        <h2 class="title">Tipos de instrucciones</h2>

        <p>Una m&aacute;quina puede llegar a funcionar con un juego de instrucciones 
            muy limitado (recu&eacute;rdese, por ejemplo, la m&aacute;quina de Turing 
            que s&oacute;lo tiene 4 instrucciones, incluso se han diseñado m&aacute;quinas
             te&oacute;ricas con menos instrucciones), esto simplificar&iacute;a mucho los 
             circuitos de la m&aacute;quina. Sin embargo, un conjunto de instrucciones demasiado
              simplificado origina, como consecuencia, unos programas demasiado complejos e ineficientes.
               Es necesario encontrar un compromiso entre la simplicidad del hardware y del software. 
               Un m&iacute;nimo para llegar a ese compromiso se consigue con los tipos
                de instrucciones siguientes: 
            Instrucciones de transferencia de datos. 
            Instrucciones aritm&eacute;ticas. 
            Instrucciones l&oacute;gicas. 
            Instrucciones de control del flujo del programa (bifurcaciones, bucles, procedimientos, etc.)</p>

    </section>


    <section class="content price">
        <article class="contain">
            <p>           
                Instrucciones de entrada y salida. En los apartados siguientes iremos 
                viendo con detalle algunos de estos tipos de instrucciones. Si bien es cierto 
                que el conjunto de instrucciones debe de cumplir unos m&iacute;nimos para conseguir
                 una m&iacute;nima eficiencia en los programas, tambi&eacute;n se ver&aacute; que
                  &eacute;sta no se aumenta indefinidamente al incrementar el n&uacute;mero de 
                  instrucciones de la m&aacute;quina.
            </p>

            
            <p center><img src="../img/conjunto.jpg" height="300" width="500"></p>
        </article>    
    </section>

    
    <section class="content price">
    </section>

</body>
</html>