<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.1/css/all.min.css">
    <link rel="stylesheet" href="../style.css">
    <title>Chip Set</title>
</head>
<body>

    <div class="head">

        <div class="logo">
            <a href="#"></a>
        </div>

        <nav class="navbar">
            <a href="../index.html">Inicio</a>
            <a href="./Unidad1.html">Unidad 1</a>
            <a href="./Unidad2.html">Unidad 2</a>
            <a href="./Unidad3.html">Unidad 3</a>
            <a href="./Unidad4.html">Unidad 4</a>
            <a href="./Unidad5.html">Pr치cticas</a>
            <a href="./Reportes.html">Reportes</a>
        </nav>

    </div>

    <header class="content header">
        <h2 class="title">3.1 Chip Set</h2>

        <p>
            Un chipset (traducido como circuito integrado auxiliar) es el 
            conjunto de circuitos integrados dise침ados con base en la arquitectura 
            de un procesador (en algunos casos, dise침ados como parte integral de esa 
            arquitectura), permitiendo que ese tipo de procesadores funcionen en una 
            placa base. Sirven de puente de comunicaci&oacute;n con el resto de componentes
             de la placa, como son la memoria, las tarjetas de expansi&oacute;n, los puertos 
             USB, rat&oacute;n, teclado, etc.

        </p>
    </header>

    <section class="content sau">

        <p>
            Las placas base modernas suelen incluir dos integrados, denominados puente 
            norte y puente sur, y suelen ser los circuitos integrados m&aacute;s grandes
             despu&eacute;s de la GPU y el microprocesador. Las &uacute;ltimas placa base
              carecen de puente norte, ya que los procesadores de &uacute;ltima generaci&oacute;n 
              lo llevan integrado.

        </p>
    </section>
    
    <section class="content about">
        <p>
            El chipset determina muchas de las caracter&iacute;sticas de una placa 
            base y por lo general la referencia de la misma est&aacute; relacionada 
            con la del chipset.

        </p>
        <p>
            A diferencia del microcontrolador, el procesador no tiene mayor funcionalidad 
            sin el soporte de un chipset: la importancia del mismo ha sido relegada a un 
            segundo plano por las estrategias de mercadotecnia.

        </p>

    </section>

    <section class="content price">
        <article class="contain">
            <p>
                El Chipset es el que hace posible que la placa base funcione como 
                eje del sistema, dando soporte a varios componentes e interconect&aacute;ndolos
                 de forma que se comuniquen entre ellos haciendo uso de diversos buses. Es uno
                  de los pocos elementos que tiene conexi&oacute;n directa con el procesador,
                   gestiona la mayor parte de la informaci&oacute;n que entra y sale por el bus
                    principal del procesador, del sistema de v&iacute;deo y muchas veces de la memoria RAM.

            </p>
            <p>
                En el caso de los computadores PC, es un esquema de arquitectura abierta que 
                establece modularidad: el Chipset debe tener interfaces est&aacute;ndar para los 
                dem&aacute;s dispositivos. Esto permite escoger entre varios dispositivos 
                est&aacute;ndar, por ejemplo en el caso de los buses de expansi&oacute;n, 
                algunas tarjetas madre pueden tener bus PCI-Express y soportar diversos tipos
                 de tarjetas de distintos anchos de bus (1x, 8x, 16x).

            </p>

        </article>    
    </section>

    <section class="content price">
        <article class="contain">
<p>
    En el caso de equipos port&aacute;tiles o de marca, el chipset puede ser dise침ado
     a la medida y aunque no soporte gran variedad de tecnolog&iacute;as, presentar&aacute; 
     alguna interfaz de dispositivo.

</p>


<p center><img src="../img/chip.jpg" height="300" width="400"></p>
        </article> 
    </section>
    
    <section class="content price"></section>
</body>
</html>