<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.1/css/all.min.css">
    <link rel="stylesheet" href="../style.css">
    <title>Comercio Electr&oacute;nico</title>
</head>
<body>
    <div class="head">

        <div class="logo">
            <a href="#"></a>
        </div>

        <nav class="navbar">
            <a href="../index.html">Inicio</a>
            <a href="./Unidad1.html">Unidad 1</a>
            <a href="./Unidad2.html">Unidad 2</a>
            <a href="./Unidad3.html">Unidad 3</a>
            <a href="./Unidad4.html">Unidad 4</a>
            <a href="./Unidad5.html">Prácticas</a>
            <a href="./Reportes.html">Reportes</a>
        </nav>

    </div>

    <header class="content header">
        <h2 class="title">3.3.3 Comercio Electr&oacute;nico</h2>
    </header>

    <section class="content sau">
        <p>
            A pesar de la gran variedad de dispositivos tecnol&oacute;gicos que nos ofrece 
            el mercado hoy en d&iacute;a, las computadoras siguen siendo el principal canal para el
             comercio electr&oacute;nico.

        </p>

        <p>
            Seg&uacute;n un estudio realizado en San Pablo por la plataforma Groupon,
             este resultado se ha presentado en las cinco mayores econom&iacute;as de Latinoam&eacute;rica.
              Dando paso a las estad&iacute;sticas, se realiz&oacute; un sondeo a 6000 personas en
               pa&iacute;ses como M&eacute;xico, Brasil, Argentina, Colombia y Chile. El 79% de los
                entrevistados optan por comprar en internet a trav&eacute;s de la computadora.

        </p>
    </section>

    
    <section class="content about">
<p>
    Tal vez, con el auge de los Smartphone, principalmente, se podr&iacute;a tender a pensar que la compra 
    online tambi&eacute;n se realizar&iacute;a m&aacute;s que nada a trav&eacute;s de ellos, ya que 
    actualmente las personas los utilizan para pr&aacute;cticamente todo. Pero sorpresivamente, el uso
     de tel&eacute;fonos inteligentes para realizar compras fue de un 15% (cifra que en Brasil se
      elev&oacute; a 21%).
</p>


    </section>

    
    <section class="content price">

        <p>
            Lo interesante de este estudio fue que se observ&oacute; que el 79% de los entrevistados
             manifestaron comprar m&aacute;s en la red que hace cinco años. Tambi&eacute;n cabe destacar 
             que m&aacute;s de la mitad de quienes fueron consultados usan internet para investigar sobre
              productos y servicios antes de cerrar la compra de forma virtual o f&iacute;sica.
        
        </p>
        
        <p>
            Actualmente se le brinda una cantidad de facilidades para que el usuario pueda experimentar
             de forma &oacute;ptima y gratificante las compras virtuales, con asesoramiento online, tiendas 
             virtuales, fotograf&iacute;as ilustrativas, entre otras.
        
        </p>

        
        <p center><img src="../img/comercio.jpg" height="300" width="600"></p>

    </section>
    
    <section class="content price">
    </section>
</body>
</html>