<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.1/css/all.min.css">
    <link rel="stylesheet" href="../style.css">
    <title>Aspectos b&aacute;sicos de la Computadora Paralela</title>
</head>
<body>
    <div class="head">

        <div class="logo">
            <a href="#"></a>
        </div>

        <nav class="navbar">
            <a href="../index.html">Inicio</a>
            <a href="./Unidad1.html">Unidad 1</a>
            <a href="./Unidad2.html">Unidad 2</a>
            <a href="./Unidad3.html">Unidad 3</a>
            <a href="./Unidad4.html">Unidad 4</a>
            <a href="./Unidad5.html">Prácticas</a>
            <a href="./Reportes.html">Reportes</a>
        </nav>

    </div>

    <header class="content header">
        <br><br><br><br><br><br><br>
        <br>
        <h2 class="title">4.1 Aspectos b&aacute;sicos de la Computadora Paralela</h2>

        <p>
            La computaci&oacute;n paralela es una forma de c&oacute;mputo en
             la que muchas instrucciones se ejecutan simult&aacute;neamente, operando sobre el
              principio de que problemas grandes, a menudo se pueden dividir en unos m&aacute;s 
              pequeños, que luego son resueltos simult&aacute;neamente (en paralelo). Hay varias
               formas diferentes de computaci&oacute;n paralela: paralelismo a nivel de bit, 
               paralelismo a nivel de instrucci&oacute;n, paralelismo de datos y paralelismo de
                tareas. El paralelismo se ha empleado durante muchos años, sobre todo en la
                 computaci&oacute;n de altas prestaciones, pero el inter&eacute;s en ella ha
                  crecido &uacute;ltimamente debido a las limitaciones f&iacute;sicas que impiden
                   el aumento de la frecuencia. Como el consumo de energ&iacute;a —y por 
                   consiguiente la generaci&oacute;n de calor— de las computadoras constituye
                    una preocupaci&oacute;n en los &uacute;ltimos años, la computaci&oacute;n 
                    en paralelo se ha convertido en el paradigma dominante en la arquitectura de 
                    computadores, principalmente en forma de procesadores multin&uacute;cleo.

        </p>

    </header>

    
    <section class="content sau">
        <br><br><br><br>
        <p> Las computadoras paralelas pueden clasificarse seg&uacute;n 
            el nivel de paralelismo que admite su hardware: equipos con procesadores multin&uacute;cleo y 
            multi-procesador que tienen m&uacute;ltiples elementos de procesamiento dentro de una sola
             m&aacute;quina y los cl&uacute;steres, MPPS y grids que utilizan varios equipos para trabajar
              en la misma tarea. Muchas veces, para acelerar la tareas espec&iacute;ficas, se utilizan 
              arquitecturas especializadas de computaci&oacute;n en paralelo junto a procesadores 
              tradicionales.

        </p>
        <p>
            Los programas inform&aacute;ticos paralelos son m&aacute;s dif&iacute;ciles de
             escribir que los secuenciales, porque la concurrencia introduce nuevos tipos de 
             errores de software, siendo las condiciones de carrera los m&aacute;s comunes. La
              comunicaci&oacute;n y sincronizaci&oacute;n entre diferentes subtareas son algunos de 
              los mayores obst&aacute;culos para obtener un buen rendimiento del programa paralelo.


        </p>
        <p>
            La m&aacute;xima aceleraci&oacute;n posible de un programa como resultado de la
             paralelizaci&oacute;n se conoce como la ley de Amdahl.

        </p>
    </section>
    
    <section class="content price">
        <br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>
        <h2 class="title">Aspectos a considerar</h2>
        <p>

            Diseño de computadores paralelo: Escalabilidad y Comunicaciones.
        </p>
        <p>
            Diseño de algoritmos eficientes: No hay ganancia si los algoritmos no se diseñan adecuadamente.
        </p>
        <p>
            M&eacute;todos para evaluar los algoritmos paralelos:
        </p>

        <p>
            ¿C&oacute;mo de r&aacute;pido se puede resolver un problema usando una m&aacute;quina
             paralela? ¿Con qu&eacute; eficiencia se usan esos procesadores?.</p>

    <p>Lenguajes para computadores paralelos, flexibles para permitir una implementaci&oacute;n 
        eficiente y que sean f&aacute;ciles de programar.</p>
        <p> Herramientas para la programaci&oacute;n paralela.</p>
           <p>Programas paralelos portables.</p>
            <p>
                Compiladores paralelizantes.</p>

        

    </section>
    
    <section class="content price"></section>

</body>
</html>